adharshr15/AFTAC-DL/STM32F746/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "ai_datatypes_defines.h"
#include "ai_platform.h"
#include "soh_model.h"
#include "soh_model_data.h"
#include "soh_model_data_params.h"
#include "soh_model_config.h"
#include <stdio.h>
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "string.h"
#include "cmsis_os.h"
#include "fatfs.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f7xx.h" // Includes SysTick definitions like SysTick_Type
#include "core_cm7.h"  // Provides CMSIS definitions
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
#if defined ( __ICCARM__ ) /*!< IAR Compiler */
#pragma location=0x2004c000
ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
#pragma location=0x2004c0a0
ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __CC_ARM )  /* MDK ARM Compiler */

__attribute__((at(0x2004c000))) ETH_DMADescTypeDef  DMARxDscrTab[ETH_RX_DESC_CNT]; /* Ethernet Rx DMA Descriptors */
__attribute__((at(0x2004c0a0))) ETH_DMADescTypeDef  DMATxDscrTab[ETH_TX_DESC_CNT]; /* Ethernet Tx DMA Descriptors */

#elif defined ( __GNUC__ ) /* GNU Compiler */

ETH_DMADescTypeDef DMARxDscrTab[ETH_RX_DESC_CNT] __attribute__((section(".RxDecripSection"))); /* Ethernet Rx DMA Descriptors */
ETH_DMADescTypeDef DMATxDscrTab[ETH_TX_DESC_CNT] __attribute__((section(".TxDecripSection")));   /* Ethernet Tx DMA Descriptors */
#endif

ETH_TxPacketConfig TxConfig;

ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

ETH_HandleTypeDef heth;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;
TIM_HandleTypeDef htim14;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
// void SystemClock_Config(void);
// void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
// static void MX_ADC3_Init(void);
// static void MX_CRC_Init(void);
// static void MX_DCMI_Init(void);
// static void MX_DMA2D_Init(void);
// static void MX_ETH_Init(void);
// static void MX_FMC_Init(void);
// static void MX_I2C1_Init(void);
// static void MX_I2C3_Init(void);
// static void MX_LTDC_Init(void);
// static void MX_QUADSPI_Init(void);
// static void MX_RTC_Init(void);
// static void MX_SAI2_Init(void);
// static void MX_SDMMC1_SD_Init(void);
// static void MX_SPDIFRX_Init(void);
// static void MX_SPI2_Init(void);
// static void MX_TIM1_Init(void);
// static void MX_TIM2_Init(void);
// static void MX_TIM3_Init(void);
// static void MX_TIM5_Init(void);
// static void MX_TIM8_Init(void);
// static void MX_TIM12_Init(void);
// static void MX_TIM14_Init(void);
static void MX_USART1_UART_Init(void);
// static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// Function to set up the SysTick timer for maximum counting range
void init_systick_timer(void)
{
  // 1. Disable SysTick (required before configuration)
  SysTick->CTRL = 0;

  // 2. Set the RELOAD register to the maximum 24-bit value (0xFFFFFF).
  // This allows it to count for the longest period possible without wrapping.
  SysTick->LOAD = 0xFFFFFF;

  // 3. Clear the current value register
  SysTick->VAL = 0;

  // 4. Enable SysTick and use the CPU clock (AHB clock) as the source.
  // The AHB clock is typically 216MHz on the STM32F746-Discovery board.
  SysTick->CTRL = SysTick_CTRL_CLKSOURCE_Msk | SysTick_CTRL_ENABLE_Msk;
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  char buf[128];
  int buf_len = 0;
  ai_error ai_err;
  ai_i32 nbatch;
  uint32_t timestamp;
  float y_val;

  AI_ALIGNED(4)
  ai_u8 activations[AI_SOH_MODEL_DATA_ACTIVATIONS_SIZE];

  AI_ALIGNED(4)
  ai_u8 in_data[AI_SOH_MODEL_IN_1_SIZE_BYTES];
  AI_ALIGNED(4)
  ai_u8 out_data[AI_SOH_MODEL_OUT_1_SIZE_BYTES];

  ai_handle soh_model = AI_HANDLE_NULL;

