adharshr15/AFTAC-DL/STM32F746/Core/Src/main.c
  /* Replace deprecated static ai_buffer initializers with runtime pointers */
  ai_buffer *ai_input = NULL;
  ai_buffer *ai_output = NULL;

  ai_network_params ai_params = {
      AI_SOH_MODEL_DATA_WEIGHTS(ai_soh_model_data_weights_get()),
      AI_SOH_MODEL_DATA_ACTIVATIONS(activations)};
  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  // SystemClock_Config();

  /* Configure the peripherals common clocks */
  // PeriphCommonClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  // MX_ADC3_Init();
  // MX_CRC_Init();
  // MX_DCMI_Init();
  // MX_DMA2D_Init();
  // MX_ETH_Init();
  // MX_FMC_Init();
  // MX_I2C1_Init();
  // MX_I2C3_Init();
  // MX_LTDC_Init();
  // MX_QUADSPI_Init();
  // MX_RTC_Init();
  // MX_SAI2_Init();
  // MX_SDMMC1_SD_Init();
  // MX_SPDIFRX_Init();
  // MX_SPI2_Init();
  // MX_TIM1_Init();
  // MX_TIM2_Init();
  // MX_TIM3_Init();
  // MX_TIM5_Init();
  // MX_TIM8_Init();
  // MX_TIM12_Init();
  // MX_TIM14_Init();
  MX_USART1_UART_Init();
  // MX_USART6_UART_Init();
  // MX_FATFS_Init();
  /* USER CODE BEGIN 2 */
  // HAL_TIM_Base_Start(&htim14);
  init_systick_timer();

  // Greetings!
  buf_len = sprintf(buf, "\r\n\r\nSTM32 X-Cube-AI test\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);

  // Create instance of neural network
  ai_err = ai_soh_model_create(&soh_model, AI_SOH_MODEL_DATA_CONFIG);
  if (ai_err.type != AI_ERROR_NONE)
  {
    buf_len = sprintf(buf, "Error: could not create NN instance\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);
    while (1)
      ;
  }

  // Initialize neural network
  if (!ai_soh_model_init(soh_model, &ai_params))
  {
    buf_len = sprintf(buf, "Error: could not initialize NN\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);
    while (1)
      ;
  }

  /* After the network is created/initialized obtain I/O buffer descriptors */
  ai_input = ai_soh_model_inputs_get(soh_model, NULL);
  ai_output = ai_soh_model_outputs_get(soh_model, NULL);

  /* Set data pointers to our local buffers */
  if (ai_input)
    ai_input[0].data = AI_HANDLE_PTR(in_data);
  if (ai_output)
    ai_output[0].data = AI_HANDLE_PTR(out_data);
  /* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* USER CODE BEGIN RTOS_QUEUES */
  /* add queues, ... */
  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* definition and creation of defaultTask */
  // osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 4096);
  // defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* Start scheduler */
  // osKernelStart();

  /* We should never get here as control is now taken by the scheduler */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  float start_i = 0.0f;
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
    // Variable declarations (C89 requires all declarations at the start)
    ai_float *input_array;
    uint32_t i;
    int int_part, frac_part;
    uint32_t start_cycles, end_cycles, elapsed_cycles;
    float time_seconds;
    int time_int, time_frac;
    int y_int, y_frac;

    // Fill input data
    input_array = (ai_float *)in_data;
    for (i = 0; i < AI_SOH_MODEL_IN_1_SIZE; i++)
    {
      input_array[i] = (ai_float)(start_i + (ai_float)i * 0.1f);
    }

    /* Print first few inputs for debugging - check what ai_input actually points to */
    buf_len = sprintf(buf, "ai_input (first 5): ");
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);

    for (i = 0; i < 5 && i < AI_SOH_MODEL_IN_1_SIZE; ++i)
    {
      // Manual float conversion (sprintf %f may not be enabled)
      int_part = (int)input_array[i];
      frac_part = (int)((input_array[i] - (float)int_part) * 100);
      if (frac_part < 0)
      frac_part = -frac_part;
      buf_len = sprintf(buf, "%d.%02d ", int_part, frac_part);
      HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);
    }

    buf_len = sprintf(buf, "\r\n");
    HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);

    // Get current timestamp
    start_cycles = SysTick->VAL;

    // Perform inference
    nbatch = ai_soh_model_run(soh_model, ai_input, ai_output);
    if (nbatch != 1)
    {
      buf_len = sprintf(buf, "Error: could not run inference\r\n");
      HAL_UART_Transmit(&huart1, (uint8_t *)buf, buf_len, 100);
    }

    // Read output (predicted y) of neural network
    y_val = ((float *)out_data)[0];
    
    end_cycles = SysTick->VAL;

    // Calculate elapsed cycles (SysTick counts down)
    if (start_cycles >= end_cycles)
    {
      elapsed_cycles = start_cycles - end_cycles;
    }
    else
    {
      // Handle wrap-around
      elapsed_cycles = start_cycles + (0xFFFFFF - end_cycles) + 1;
    }

    // Calculate time in seconds (manual conversion for display)
    time_seconds = (float)elapsed_cycles / 216000000.0f; // Nvic in peripherals are 216 MHz clock
    time_int = (int)time_seconds;
    time_frac = (int)((time_seconds - time_int) * 1000000);
    if (time_frac < 0)
      time_frac = -time_frac;

